> I still have the same issue on my tests.

I copy pasted your code, filling it with the missing locals

```terraform
locals {
  organization = "kir4h"
  repository = "test-github-terraform"
  environment = "test"
  secrets = {
    myvar1 = "myvalue1"
  }
}

data "github_repository" "repo" {
  full_name = "${local.organization}/${local.repository}"
}

resource "github_repository_environment" "repo_environment" {
  repository  = data.github_repository.repo.name
  environment = local.environment
}

resource "github_actions_environment_secret" "environment_secret" {
  for_each        = local.secrets
  repository      = data.github_repository.repo.name
  environment     = github_repository_environment.repo_environment.environment
  secret_name     = each.key
  plaintext_value = each.value
}

resource "github_actions_environment_variable" "environment_variable" {
  for_each        = local.secrets
  repository      = data.github_repository.repo.name
  environment     = github_repository_environment.repo_environment.environment
  value           = each.value
  variable_name   = each.key
}
```


Apply worked as expected

```terraform
data.github_repository.repo: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_environment_secret.environment_secret["myvar1"] will be created
  + resource "github_actions_environment_secret" "environment_secret" {
      + created_at      = (known after apply)
      + environment     = "test"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "test-github-terraform"
      + secret_name     = "myvar1"
      + updated_at      = (known after apply)
    }

  # github_actions_environment_variable.environment_variable["myvar1"] will be created
  + resource "github_actions_environment_variable" "environment_variable" {
      + created_at    = (known after apply)
      + environment   = "test"
      + id            = (known after apply)
      + repository    = "test-github-terraform"
      + updated_at    = (known after apply)
      + value         = "myvalue1"
      + variable_name = "myvar1"
    }

  # github_repository_environment.repo_environment will be created
  + resource "github_repository_environment" "repo_environment" {
      + can_admins_bypass   = true
      + environment         = "test"
      + id                  = (known after apply)
      + prevent_self_review = false
      + repository          = "test-github-terraform"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

github_repository_environment.repo_environment: Creating...
github_repository_environment.repo_environment: Creation complete after 1s [id=test-github-terraform:test]
github_actions_environment_secret.environment_secret["myvar1"]: Creating...
github_actions_environment_variable.environment_variable["myvar1"]: Creating...
github_actions_environment_variable.environment_variable["myvar1"]: Creation complete after 4s [id=test-github-terraform:test:myvar1]
github_actions_environment_secret.environment_secret["myvar1"]: Creation complete after 4s [id=test-github-terraform:test:myvar1]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

Tried with current provider version and with a 5.x one just in case, both are ok.

```console
  tf version

Your version of Terraform is out of date! The latest version
is 1.7.5. You can update by downloading from https://www.terraform.io/downloads.html
Terraform v0.13.0-dev
+ provider registry.terraform.io/hashicorp/github v6.2.1
```

This is a test to a personal public repo I just created for the test though (so not an organization linked to a GH enterprise account, not sure if it makes any diff).

